In [2]:
import pandas as pd

In [3]:
titanic_df =pd.read_csv("titanic-data.csv")

In [4]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Renaming columns
 dataframe.rename()

In [8]:
titanic_df.rename({"Pclass":"PStatus","Sex":"Gender"},axis=1,inplace=True)

In [9]:
titanic_df.head
()

,PassengerId,Survived,PStatus,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

**Handling incorrect data**

In [21]:
import numpy as np
import pandas as pd

data = pd.DataFrame({
    "id": [1, 2, 3, 4, 5],
    "name": ["john", "don", "burce", "wayne", "charles"],
    "gender": ["M", "M", "Z", "F", "F"],
    "income": [400, 700, np.nan, 300, 600],
    "age": [12, -32, 22, 44, "55"]
})

print(data)

   id     name gender  income  age
0   1     john      M   400.0   12
1   2      don      M   700.0  -32
2   3    burce      Z     NaN   22
3   4    wayne      F   300.0   44
4   5  charles      F   600.0   55

In [22]:
data.age=data.age.astype(int)

In [24]:
# sample boundary
filter_age =data[(data.age>18) & (data.age <=45)]

In [25]:
filter_age

   id   name gender  income  age
2   3  burce      Z     NaN   22
3   4  wayne      F   300.0   44

In [26]:
abs(data.age)

0    12
1    32
2    22
3    44
4    55
Name: age, dtype: int64

# Saving a dataframe

In [27]:
titanic_df.to_csv("clean_data.csv",index = False)

In [28]:
titanic_df.to_json("clean_data.json", index=False,orient="records")